# ==========================================
# Python Fundamentals
# Topic: Math Module
# ==========================================

import math

# ==========================================
# Constants
# ==========================================

print("PI:", math.pi)
print("Euler number:", math.e)

print()

# ==========================================
# Trigonometric functions
# ==========================================

print("sin(2):", math.sin(2))
print("cos(2):", math.cos(2))

print()

# ==========================================
# Rounding numbers
# ==========================================

print("trunc(4.9):", math.trunc(4.9))
print("int(4.9):", int(4.9))

print()

# ==========================================
# Power
# ==========================================

print("math.pow(5, 2):", math.pow(5, 2))
print("pow(5, 2):", pow(5, 2))
print("5 * 5:", 5 * 5)
print("5 ** 2:", 5 ** 2)

print()

# ==========================================
# Square root
# ==========================================

print("sqrt(25):", math.sqrt(25))
print("sqrt(81):", math.sqrt(81))

print()

# ==========================================
# Floor and Ceil
# ==========================================

print("floor(3.8):", math.floor(3.8))
print("ceil(3.8):", math.ceil(3.8))

print()

print("floor(-3.4):", math.floor(-3.4))
print("ceil(-3.4):", math.ceil(-3.4))

# ==========================================
# Round
# ==========================================

# Округление до ближайшего целого

print("round(5.4):", round(5.4))
print("round(5.5):", round(5.5))
print("round(5.6):", round(5.6))

print()

# Округление до указанного количества знаков

print("round(5.67262, 2):", round(5.67262, 2))
print("round(5.67562, 2):", round(5.67562, 2))