# =====================================================
# Метод replace()
#
# Заменяет одну подстроку на другую.
#
# Возвращает новую строку.
# Исходная строка НЕ изменяется.
# =====================================================

text = "I love Python"

print(text)

print("-" * 30)

# Замена слова
print(text.replace("Python", "QA"))

print("-" * 30)

# Замена всех найденных символов
print(text.replace("o", "0"))

print("-" * 30)

# Можно ограничить количество замен
print(text.replace("o", "0", 1))

print("-" * 30)

# =====================================================
# Метод split()
#
# Разбивает строку на список.
#
# По умолчанию разделителем является пробел.
# Можно указать свой разделитель.
# =====================================================

textik = "Python Java C++"

print(textik)

print("-" * 30)

print(textik.split())

print(type(textik.split()))

print("-" * 30)

# =====================================================
# Метод join()
#
# Объединяет элементы последовательности
# в одну строку.
#
# Метод вызывается у строки-разделителя.
# =====================================================

languages = ["Python", "Java", "C++", "Go"]

print(", ".join(languages))

print("-" * 30)

# =====================================================
# Часто методы используются вместе.
# =====================================================

textal = "Python,Java,C++,Go"

languages = textal.split(",")

print(languages)

result = " | ".join(languages)

print(result)

print("-" * 30)

# =====================================================
# Метод strip()
#
# Удаляет пробельные символы в начале и конце строки.
#
# По умолчанию удаляет:
# - пробелы
# - символ новой строки (\n)
# - табуляцию (\t)
#
# Исходная строка НЕ изменяется.
# =====================================================

text = "    Hello World    "

print(f"До: '{text}'")

print("-" * 30)

print(f"После strip(): '{text.strip()}'")

print("-" * 30)

# можно удалить конкретный символ
name = "___Roman___"

print(name.strip("_"))