# =====================================================
# Метод isdigit()
#
# Проверяет, состоит ли строка только из цифр.
#
# Возвращает:
# True  - если строка содержит только цифры.
# False - если есть другие символы.
# =====================================================

digit = "123456"

print(digit.isdigit())   # True

print("-" * 30)

print("123abc".isdigit())   # False
print("123.45".isdigit())   # False
print("-123".isdigit())     # False
print(" ".isdigit())        # False

print("-" * 30)

# =====================================================
# Метод isalpha()
#
# Проверяет, состоит ли строка только из букв.
#
# Возвращает:
# True  - если строка содержит только буквы.
# False - если есть цифры, пробелы или другие символы.
# =====================================================

text = "Python"

print(text.isalpha())   # True

print("-" * 30)

print("Python3".isalpha())      # False
print("Python QA".isalpha())    # False
print("Python!".isalpha())      # False