# Полиморфизм (Polymorphism)
# Полиморфизм означает: "один интерфейс — много реализаций".
# Один и тот же метод или функция может работать по-разному для разных объектов.

# --------------------------------------------------
# Пример №1. Встроенная функция print()
# --------------------------------------------------

print("Hello")          # str
print(42)               # int
print(True)             # bool
print([1, 2, 3])        # list
print((1, 2, 3))        # tuple

# Одна функция print()
# работает с объектами разных типов.

# --------------------------------------------------
# Пример №2. Встроенная функция len()
# --------------------------------------------------

print(len("Python"))          # 6
print(len(range(10)))         # 10
print(len({"a": 1}))          # 1
print(len([1, 2, 3]))         # 3
print(len((1, 2, 3, 4)))      # 4

# Одна функция len()
# умеет считать длину разных объектов.

print("-" * 30)

# --------------------------------------------------
# Пример №3. Полиморфизм в ООП
# --------------------------------------------------

class Animal:

    def sound(self):
        print("Some sound")


class Cat(Animal):

    def sound(self):
        print("Meow")


class Dog(Animal):

    def sound(self):
        print("Woof")

cat = Cat()
dog = Dog()

cat.sound()
dog.sound()

# Один и тот же метод sound()
# ведет себя по-разному для разных объектов.


print("-" * 30)


# --------------------------------------------------
# Пример №4. Полиморфизм через цикл
# --------------------------------------------------

animals = [Cat(), Dog()]

for animal in animals:
    animal.sound()

# Для Cat вызывается:
# Meow
#
# Для Dog вызывается:
# Woof
#
# Хотя код один и тот же:
# animal.sound()